src/main/resources/.svn/text-base/requestAccesoBSG.vm.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://bsg.gob.ec/AccesoBSGService">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:ValidarPermiso>
         <ValidarPermisoPeticion>
            <Cedula>${headers.cedula}</Cedula>
            <Urlsw>https://www.bsg.gob.ec/sw/RC/BSGSW01_Consultar_Cedula?wsdl</Urlsw>
         </ValidarPermisoPeticion>
      </acc:ValidarPermiso>
   </soapenv:Body>
</soapenv:Envelope>